<template>
  <layout-page-provider name="about">
    <h1 class="text-h2 text-graphic">Обо <span class="text-h2 text-marked">мне</span></h1>

    <p class="app-page-about__paragraph">
      Интервью:
      <br>
      Пожалуйста, ответьте на несколько вопросов:<br>
      1. Опишите знание фреймворка VUE. Что делали на нём, какие дополнения использовали.<br>
      2. Насколько хорошо владеете TypeScript?<br>
      3. На каком уровне верстаете макет.<br>
      4. Каков ваш уровень знаний JavaScript<br>
      5. Что вам нравится в работе.<br>
      6. Что вам не нравится в работе.<br>
      7. В какое время по МСК вам удобнее всего работать.<br>
      8. Требования по заработной плате<br>
      9. Желаемый уровень заработной платы на испытательном сроке<br>
      <br>
      На что я отвечу:<br>
      <br>
      1. Начну с того что Vue для меня куда перспективнее из всей троицы.<br>
      Начинал знакомство с ним в 17 году, когда в одном из проектов решили найти замену jQuery.<br>
      Сейчас же полностью понимаю работу keep-alive, transition, scoped-slots, composition api. Понимаю принципы реактивности, умею писать плагины и сложные архитектурные модули.<br>
      <br>
      Предлагаю взглянуть на мой проект, написанный на Vue 3 & PHP<br>
      <a href="https://github.com/yesfedor/primetime-project" target="_blank" rel="noopener noreferrer">https://github.com/yesfedor/primetime-project</a>
      <br>
      Production: <a href="https://primetime.su/navigator/trand" target="_blank" rel="noopener noreferrer">https://primetime.su</a><br>
      <br>
      Оцените качество кода, а также архитектурные решения.<br>
      <br>
      Хочу познакомить вас с моим старт-шаблоном приложений для Nuxt 3, в папках есть .MD файлы, которые покажут о моих знаниях больше.<br>
      <a href="https://github.com/yesfedor/nuxt-core-template" target="_blank" rel="noopener noreferrer">https://github.com/yesfedor/nuxt-core-template</a><br>
      <br>
      Используя Vue работал с<br>
      - Vite, npm<br>
      - Vuex, Pinia<br>
      - Vue router<br>
      - i18n for<br>
      - Vuetify<br>
      <br>
      2. С typescript работаю, считаю, что его использование должно быть чётко обоснованно и это решение должны принять все в команде, так как использовать и типизировать каждую переменную черевато проблемами, которые вы, как работодатель оплачиваете.<br>
      Я же настроен впитать все необходимое, что потребует наш проект, если это typescript - я говорю, справлюсь.<br>
      <br>
      3. Считаю себя достаточно умелым верстальщиком, есть опыт в написании и поддержке внутренних ui библиотек<br>
      Знаю как настраивать сбрщики для scss, понимаю для чего нужны scoped style и shadow Dom.<br>
      <br>
      Свою вёрстку не оценю, но опишу: сверстаю шаблон из фигмы или фотошопа. Со сложной анимацией придется повозиться и вникнуть.
      Использую scss, не думаю что изучение less или stylus займет более одного дня.
      <br>
      4. Proxy, Fetch, get/set, async/await - этого не боюсь.
      Считаю, что знаю язык достаточно хорошо.
      <br>
      5. Работать, а именно, проектировать, обсуждать сложные вещи, вникнув в проект помогать новеньким, писать код, обожать фронт и быть на одной волне с бэком.
      <br>
      6. Для меня далеки такие вещи, как непонимание, бегство от проблем, лень и негатив в любом проявлении, все должны хотеть решить проблему, а не огрызаться и ставить себя выше других. Особенно если команда большая.
      <br>
      7. Готов начинать с 8мск - 10мск, до 19мск.
      <br>
      8. Нужно узнать ключ. Минимум - 200.000₽
      <br>
      Готов открыто обсуждить мои предпочтения и ваши возможности.
      <br>
      9. от 160.000₽, в зависимости от срока.
      <br>
      <br>
      Встречные вопросы:<br>
      1. Готовы ли вы к долгому сотрудничеству, не люблю прыгать с места на места, теряя по пол года на понимание проекта.<br>
      2. Срок испытательного срока<br>
      3. Какая команда, сколько человек, ценности<br>
      4. Кому я подчиняюсь<br>
      5. Проводите ли вы код ревью<br>
      6. Документируете ли код<br>
      7. Пишет ли QA-отдел автотесты<br>
      <br>
      С уважением,<br>
      Гаранин Фёдор Владиславович
    </p>
  </layout-page-provider>
</template>

<script lang="ts" setup>

</script>

<style lang="scss">
.app-page-about {
  &__paragraph {
    margin: 36rem 0 0;
  }
}
</style>
